---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireMaterialType)
source: html/e03ccb9c-34a0-cbe2-3fa4-6fc4ef8e884c.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Contains Method

Tests for the existence of a wire material type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	WireMaterialType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireMaterialType`) - The wire material type to be searched for.

## Returns
The Contains method returns True if the wire material type is within the set, otherwise False.